mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2g3xj/common/s6e2g3xj.h
#define bFM_BT1_PWC_TMCR2_CKS3                    *((volatile  uint8_t *)(0x424A0A20UL))
#define bFM4_BT1_PWC_TMCR2_CKS3                   *((volatile  uint8_t *)(0x424A0A20UL))

#define bFM_BT1_PWM_STC_UDIR                      *((volatile  uint8_t *)(0x424A0A00UL))
#define bFM4_BT1_PWM_STC_UDIR                     *((volatile  uint8_t *)(0x424A0A00UL))
#define bFM_BT1_PWM_STC_DTIR                      *((volatile  uint8_t *)(0x424A0A04UL))
#define bFM4_BT1_PWM_STC_DTIR                     *((volatile  uint8_t *)(0x424A0A04UL))
#define bFM_BT1_PWM_STC_TGIR                      *((volatile  uint8_t *)(0x424A0A08UL))
#define bFM4_BT1_PWM_STC_TGIR                     *((volatile  uint8_t *)(0x424A0A08UL))
#define bFM_BT1_PWM_STC_UDIE                      *((volatile  uint8_t *)(0x424A0A10UL))
#define bFM4_BT1_PWM_STC_UDIE                     *((volatile  uint8_t *)(0x424A0A10UL))
#define bFM_BT1_PWM_STC_DTIE                      *((volatile  uint8_t *)(0x424A0A14UL))
#define bFM4_BT1_PWM_STC_DTIE                     *((volatile  uint8_t *)(0x424A0A14UL))
#define bFM_BT1_PWM_STC_TGIE                      *((volatile  uint8_t *)(0x424A0A18UL))
#define bFM4_BT1_PWM_STC_TGIE                     *((volatile  uint8_t *)(0x424A0A18UL))

#define bFM_BT1_PWM_TMCR_STRG                     *((volatile  uint8_t *)(0x424A0980UL))
#define bFM4_BT1_PWM_TMCR_STRG                    *((volatile  uint8_t *)(0x424A0980UL))
#define bFM_BT1_PWM_TMCR_CTEN                     *((volatile  uint8_t *)(0x424A0984UL))
#define bFM4_BT1_PWM_TMCR_CTEN                    *((volatile  uint8_t *)(0x424A0984UL))
#define bFM_BT1_PWM_TMCR_MDSE                     *((volatile  uint8_t *)(0x424A0988UL))
#define bFM4_BT1_PWM_TMCR_MDSE                    *((volatile  uint8_t *)(0x424A0988UL))
#define bFM_BT1_PWM_TMCR_OSEL                     *((volatile  uint8_t *)(0x424A098CUL))
#define bFM4_BT1_PWM_TMCR_OSEL                    *((volatile  uint8_t *)(0x424A098CUL))
#define bFM_BT1_PWM_TMCR_PMSK                     *((volatile  uint8_t *)(0x424A09A8UL))
#define bFM4_BT1_PWM_TMCR_PMSK                    *((volatile  uint8_t *)(0x424A09A8UL))
#define bFM_BT1_PWM_TMCR_RTGEN                    *((volatile  uint8_t *)(0x424A09ACUL))
#define bFM4_BT1_PWM_TMCR_RTGEN                   *((volatile  uint8_t *)(0x424A09ACUL))

#define bFM_BT1_PWM_TMCR2_CKS3                    *((volatile  uint8_t *)(0x424A0A20UL))
#define bFM4_BT1_PWM_TMCR2_CKS3                   *((volatile  uint8_t *)(0x424A0A20UL))

#define bFM_BT1_RT_STC_UDIR                       *((volatile  uint8_t *)(0x424A0A00UL))
#define bFM4_BT1_RT_STC_UDIR                      *((volatile  uint8_t *)(0x424A0A00UL))
#define bFM_BT1_RT_STC_TGIR                       *((volatile  uint8_t *)(0x424A0A08UL))
#define bFM4_BT1_RT_STC_TGIR                      *((volatile  uint8_t *)(0x424A0A08UL))
#define bFM_BT1_RT_STC_UDIE                       *((volatile  uint8_t *)(0x424A0A10UL))
#define bFM4_BT1_RT_STC_UDIE                      *((volatile  uint8_t *)(0x424A0A10UL))
#define bFM_BT1_RT_STC_TGIE                       *((volatile  uint8_t *)(0x424A0A18UL))
#define bFM4_BT1_RT_STC_TGIE                      *((volatile  uint8_t *)(0x424A0A18UL))

#define bFM_BT1_RT_TMCR_STRG                      *((volatile  uint8_t *)(0x424A0980UL))
#define bFM4_BT1_RT_TMCR_STRG                     *((volatile  uint8_t *)(0x424A0980UL))
#define bFM_BT1_RT_TMCR_CTEN                      *((volatile  uint8_t *)(0x424A0984UL))
#define bFM4_BT1_RT_TMCR_CTEN                     *((volatile  uint8_t *)(0x424A0984UL))
#define bFM_BT1_RT_TMCR_MDSE                      *((volatile  uint8_t *)(0x424A0988UL))
#define bFM4_BT1_RT_TMCR_MDSE                     *((volatile  uint8_t *)(0x424A0988UL))
#define bFM_BT1_RT_TMCR_OSEL                      *((volatile  uint8_t *)(0x424A098CUL))
#define bFM4_BT1_RT_TMCR_OSEL                     *((volatile  uint8_t *)(0x424A098CUL))
#define bFM_BT1_RT_TMCR_T32                       *((volatile  uint8_t *)(0x424A099CUL))
#define bFM4_BT1_RT_TMCR_T32                      *((volatile  uint8_t *)(0x424A099CUL))

#define bFM_BT1_RT_TMCR2_CKS3                     *((volatile  uint8_t *)(0x424A0A20UL))
#define bFM4_BT1_RT_TMCR2_CKS3                    *((volatile  uint8_t *)(0x424A0A20UL))
#define bFM_BT1_RT_TMCR2_GATE                     *((volatile  uint8_t *)(0x424A0A3CUL))
#define bFM4_BT1_RT_TMCR2_GATE                    *((volatile  uint8_t *)(0x424A0A3CUL))


/*******************************************************************************
* BT Registers BT10
*   Bitband Section
*******************************************************************************/
#define bFM_BT10_PPG_STC_UDIR                     *((volatile  uint8_t *)(0x424A9200UL))
#define bFM4_BT10_PPG_STC_UDIR                    *((volatile  uint8_t *)(0x424A9200UL))
#define bFM_BT10_PPG_STC_TGIR                     *((volatile  uint8_t *)(0x424A9208UL))
#define bFM4_BT10_PPG_STC_TGIR                    *((volatile  uint8_t *)(0x424A9208UL))
#define bFM_BT10_PPG_STC_UDIE                     *((volatile  uint8_t *)(0x424A9210UL))
#define bFM4_BT10_PPG_STC_UDIE                    *((volatile  uint8_t *)(0x424A9210UL))
#define bFM_BT10_PPG_STC_TGIE                     *((volatile  uint8_t *)(0x424A9218UL))
#define bFM4_BT10_PPG_STC_TGIE                    *((volatile  uint8_t *)(0x424A9218UL))

#define bFM_BT10_PPG_TMCR_STRG                    *((volatile  uint8_t *)(0x424A9180UL))
#define bFM4_BT10_PPG_TMCR_STRG                   *((volatile  uint8_t *)(0x424A9180UL))
#define bFM_BT10_PPG_TMCR_CTEN                    *((volatile  uint8_t *)(0x424A9184UL))
#define bFM4_BT10_PPG_TMCR_CTEN                   *((volatile  uint8_t *)(0x424A9184UL))
#define bFM_BT10_PPG_TMCR_MDSE                    *((volatile  uint8_t *)(0x424A9188UL))
#define bFM4_BT10_PPG_TMCR_MDSE                   *((volatile  uint8_t *)(0x424A9188UL))
#define bFM_BT10_PPG_TMCR_OSEL                    *((volatile  uint8_t *)(0x424A918CUL))
#define bFM4_BT10_PPG_TMCR_OSEL                   *((volatile  uint8_t *)(0x424A918CUL))
#define bFM_BT10_PPG_TMCR_PMSK                    *((volatile  uint8_t *)(0x424A91A8UL))
#define bFM4_BT10_PPG_TMCR_PMSK                   *((volatile  uint8_t *)(0x424A91A8UL))
#define bFM_BT10_PPG_TMCR_RTGEN                   *((volatile  uint8_t *)(0x424A91ACUL))
#define bFM4_BT10_PPG_TMCR_RTGEN                  *((volatile  uint8_t *)(0x424A91ACUL))

#define bFM_BT10_PPG_TMCR2_CKS3                   *((volatile  uint8_t *)(0x424A9220UL))
#define bFM4_BT10_PPG_TMCR2_CKS3                  *((volatile  uint8_t *)(0x424A9220UL))

#define bFM_BT10_PWC_STC_OVIR                     *((volatile  uint8_t *)(0x424A9200UL))
#define bFM4_BT10_PWC_STC_OVIR                    *((volatile  uint8_t *)(0x424A9200UL))
#define bFM_BT10_PWC_STC_EDIR                     *((volatile  uint8_t *)(0x424A9208UL))
#define bFM4_BT10_PWC_STC_EDIR                    *((volatile  uint8_t *)(0x424A9208UL))
#define bFM_BT10_PWC_STC_OVIE                     *((volatile  uint8_t *)(0x424A9210UL))
#define bFM4_BT10_PWC_STC_OVIE                    *((volatile  uint8_t *)(0x424A9210UL))
#define bFM_BT10_PWC_STC_EDIE                     *((volatile  uint8_t *)(0x424A9218UL))
#define bFM4_BT10_PWC_STC_EDIE                    *((volatile  uint8_t *)(0x424A9218UL))
#define bFM_BT10_PWC_STC_ERR                      *((volatile  uint8_t *)(0x424A921CUL))
#define bFM4_BT10_PWC_STC_ERR                     *((volatile  uint8_t *)(0x424A921CUL))

